cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'd12frosted/emacs-plus'
tap 'thoughtbot/formulae'

brew 'coreutils'
brew 'neovim'
brew 'fzf'
brew 'tmux'
brew 'tig'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'nvm'
brew 'ripgrep'
brew 'yarn', args: ['without-node']
brew 'emacs-plus'
brew 'rcm'

cask 'iterm2'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'slack'
cask 'flowdock'
cask 'font-hack-nerd-font'
cask 'font-hasklig-nerd-font'
cask 'font-firacode-nerd-font'
cask 'font-sourcecodepro-nerd-font'
cask 'font-source-code-pro'
cask 'slate'
cask 'dash'
cask 'acorn'
cask 'launchbar'
cask 'sourcetree'
