cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

brew 'yarn'
brew 'neovim'
brew 'fzf'
brew 'tmux'
brew 'tig'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'

cask 'iterm2'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'slack'
cask 'flowdock'
cask 'font-hasklig-nerd-font'
cask 'font-firacode-nerd-font'
cask 'slate'
cask 'dash'
